In [1]:
from numpy import nan
import pandas as pd

<h2>缺失数据处理</h2>

1.去除

In [3]:
data = pd.Series([1, nan, 3.5, nan, 7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [4]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

对于DataFrame对象，dropna代表删去一行

In [7]:
data = pd.DataFrame([[1, 2, 3], [2, 3, 4], [nan, nan, nan], [2, 3, nan]])
data1 = data.dropna()
data1

     0    1    2
0  1.0  2.0  3.0
1  2.0  3.0  4.0

传入how=all丢弃全为NA的那些行：

In [9]:
data.dropna(how='all')

     0    1    2
0  1.0  2.0  3.0
1  2.0  3.0  4.0
3  2.0  3.0  NaN

In [11]:
data[3] = 1
data

     0    1    2  3
0  1.0  2.0  3.0  1
1  2.0  3.0  4.0  1
2  NaN  NaN  NaN  1
3  2.0  3.0  NaN  1

In [13]:
data[4] = nan
data.dropna(axis=1, how='all')

     0    1    2  3
0  1.0  2.0  3.0  1
1  2.0  3.0  4.0  1
2  NaN  NaN  NaN  1
3  2.0  3.0  NaN  1

In [14]:
import numpy as np
data = pd.DataFrame(np.random.randn(7, 4))
data.iloc[:3, 1] = nan
data.iloc[:2, 2] = nan
data

          0         1         2         3
0  0.499048       NaN       NaN  1.654587
1  0.782118       NaN       NaN  1.353921
2  0.450938       NaN  0.805986  0.134492
3 -0.745261  1.466647 -1.659373  0.503156
4 -0.284519 -0.527057 -0.562226 -0.268097
5  0.751980 -0.191254  0.386702  0.504882
6  0.600283  1.157232  0.694309 -0.134985

In [15]:
data.dropna()

          0         1         2         3
3 -0.745261  1.466647 -1.659373  0.503156
4 -0.284519 -0.527057 -0.562226 -0.268097
5  0.751980 -0.191254  0.386702  0.504882
6  0.600283  1.157232  0.694309 -0.134985

In [17]:
data.dropna(thresh=1)

          0         1         2         3
0  0.499048       NaN       NaN  1.654587
1  0.782118       NaN       NaN  1.353921
2  0.450938       NaN  0.805986  0.134492
3 -0.745261  1.466647 -1.659373  0.503156
4 -0.284519 -0.527057 -0.562226 -0.268097
5  0.751980 -0.191254  0.386702  0.504882
6  0.600283  1.157232  0.694309 -0.134985

<h3>数据的填充</h3>

In [19]:
data = pd.DataFrame(np.random.randn(4, 6))
data.iloc[:3, 1] = nan
data

          0         1         2         3         4         5
0 -0.496625       NaN  1.179556 -1.753137  1.231591 -0.162106
1 -2.045420       NaN -0.004003  1.998521 -1.771106  1.001937
2 -1.690040       NaN  0.739463  0.365933  1.274543  0.505200
3 -1.121634  2.215951 -0.162445 -1.033402 -1.766516  2.808194

In [20]:
data.fillna(0)

          0         1         2         3         4         5
0 -0.496625  0.000000  1.179556 -1.753137  1.231591 -0.162106
1 -2.045420  0.000000 -0.004003  1.998521 -1.771106  1.001937
2 -1.690040  0.000000  0.739463  0.365933  1.274543  0.505200
3 -1.121634  2.215951 -0.162445 -1.033402 -1.766516  2.808194

In [21]:
data.fillna({1: 0.1})    # 对不同的列填充不同的值：

          0         1         2         3         4         5
0 -0.496625  0.100000  1.179556 -1.753137  1.231591 -0.162106
1 -2.045420  0.100000 -0.004003  1.998521 -1.771106  1.001937
2 -1.690040  0.100000  0.739463  0.365933  1.274543  0.505200
3 -1.121634  2.215951 -0.162445 -1.033402 -1.766516  2.808194

In [22]:
data.fillna(method='ffill')

          0         1         2         3         4         5
0 -0.496625       NaN  1.179556 -1.753137  1.231591 -0.162106
1 -2.045420       NaN -0.004003  1.998521 -1.771106  1.001937
2 -1.690040       NaN  0.739463  0.365933  1.274543  0.505200
3 -1.121634  2.215951 -0.162445 -1.033402 -1.766516  2.808194

In [23]:
data.fillna(method='ffill', limit=2)

          0         1         2         3         4         5
0 -0.496625       NaN  1.179556 -1.753137  1.231591 -0.162106
1 -2.045420       NaN -0.004003  1.998521 -1.771106  1.001937
2 -1.690040       NaN  0.739463  0.365933  1.274543  0.505200
3 -1.121634  2.215951 -0.162445 -1.033402 -1.766516  2.808194

In [24]:
data.fillna(data.mean())

          0         1         2         3         4         5
0 -0.496625  2.215951  1.179556 -1.753137  1.231591 -0.162106
1 -2.045420  2.215951 -0.004003  1.998521 -1.771106  1.001937
2 -1.690040  2.215951  0.739463  0.365933  1.274543  0.505200
3 -1.121634  2.215951 -0.162445 -1.033402 -1.766516  2.808194

<h3>数据转换</h3>

1.移除重复数据

In [25]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
                      'k2': [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [26]:
data['v1'] = range(7)
data.drop_duplicates(['k1'])  # 根据k1筛选

    k1  k2  v1
0  one   1   0
1  two   1   1

利用函数和映射进行数据转换

In [27]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
                            'Pastrami', 'corned beef', 'Bacon',
                            'pastrami', 'honey ham', 'nova lox'],
                    'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [28]:
meat_to_animal = {
  'bacon': 'pig',
  'pulled pork': 'pig',
  'pastrami': 'cow',
  'corned beef': 'cow',
  'honey ham': 'pig',
  'nova lox': 'salmon'
}
lower = data['food'].str.lower()
data['animal'] = lower.map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

<h3>替换值</h3>

In [30]:
data =  pd.Series(np.random.randint(20, size=20))
data

0      1
1      1
2      4
3     11
4     16
5      9
6     14
7      9
8      9
9     19
10    19
11    11
12     6
13     5
14    16
15    16
16    18
17    16
18    19
19     3
dtype: int32

In [31]:
data.replace(3, nan)

0      1.0
1      1.0
2      4.0
3     11.0
4     16.0
5      9.0
6     14.0
7      9.0
8      9.0
9     19.0
10    19.0
11    11.0
12     6.0
13     5.0
14    16.0
15    16.0
16    18.0
17    16.0
18    19.0
19     NaN
dtype: float64

In [33]:
data.replace([4, 3], ['o', 'w'])   # 多替换

0      1
1      1
2      o
3     11
4     16
5      9
6     14
7      9
8      9
9     19
10    19
11    11
12     6
13     5
14    16
15    16
16    18
17    16
18    19
19     w
dtype: object

传入的也可以是字典

In [34]:
data.replace({1: 'v', 2: 'f'})

0      v
1      v
2      4
3     11
4     16
5      9
6     14
7      9
8      9
9     19
10    19
11    11
12     6
13     5
14    16
15    16
16    18
17    16
18    19
19     3
dtype: object

<h4>重命名轴索引</h4>

In [35]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                      index=['Ohio', 'Colorado', 'New York'],
                     columns=['one', 'two', 'three', 'four'])
transform = lambda x: x.upper()
data.index.map(transform)

Index(['OHIO', 'COLORADO', 'NEW YORK'], dtype='object')

In [36]:
data.index = data.index.map(transform)
data

          one  two  three  four
OHIO        0    1      2     3
COLORADO    4    5      6     7
NEW YORK    8    9     10    11

创建数据集的转换版: rename

In [37]:
data.rename(index=str.title, columns=str.upper)

          ONE  TWO  THREE  FOUR
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

<h3>离散化和面元分析</h3>

In [1]:
import pandas as pd
import numpy as np

In [2]:
bins = [18, 25, 35, 60, 100]
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]
cats = pd.cut(ages, bins)

In [3]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [4]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [5]:
cats.value_counts()

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
dtype: int64

In [6]:
cats.add_categories

<bound method Categorical.add_categories of [(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]>

In [7]:
data = np.random.rand(20)
cut1 = pd.cut(data, 4, precision=2)

In [8]:
cut1.codes

array([0, 0, 3, 0, 2, 1, 2, 1, 2, 1, 2, 3, 3, 0, 2, 1, 2, 3, 1, 3],
      dtype=int8)

In [9]:
cut1.value_counts()

(0.012, 0.25]    4
(0.25, 0.49]     5
(0.49, 0.74]     6
(0.74, 0.98]     5
dtype: int64

cut可能无法使各个面元中含有相同数量的数据点。而qcut由于使用的是样本分位数，因此可以得到大小基本相等的面元：

In [11]:
data = np.random.randn(1000)
cut2 = pd.qcut(data, 4)
cut2.value_counts()

(-2.9299999999999997, -0.77]    250
(-0.77, -0.0379]                250
(-0.0379, 0.627]                250
(0.627, 3.232]                  250
dtype: int64

<h3>检测和过滤异常值</h3>

In [2]:
import numpy as np
data = pd.DataFrame(np.random.randn(1000, 4))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.021436    -0.023652     0.051580     0.027496
std       0.984034     0.999802     0.992820     0.995310
min      -3.576910    -3.153960    -2.683573    -4.142841
25%      -0.631316    -0.698879    -0.663944    -0.615301
50%      -0.017898     0.015439     0.062881     0.068810
75%       0.691713     0.683561     0.701815     0.663324
max       2.768177     2.706929     3.336737     3.195512

In [3]:
col = data[2]
col[np.abs(col) > 3]

322    3.060772
592    3.336737
Name: 2, dtype: float64

选出全部含有“超过3或－3的值”的行， any：

In [4]:
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
81  -0.098742 -0.697307 -0.512621 -3.488323
322 -1.381529 -2.374764  3.060772 -1.227364
447  0.929417 -1.136589 -0.168488 -4.142841
506  1.408953 -3.087128 -0.734485 -0.437614
592 -0.702337 -0.253665  3.336737  0.872507
608 -0.509545  0.900403 -1.812199  3.195512
643 -3.009762 -2.473800 -0.681690  0.292926
701  0.251105 -3.153960  0.857807  2.729184
960 -3.576910  0.170144  2.417013  0.220742
973 -3.154476  0.182138 -0.200373 -0.457836

将超出的数据控制在3内

In [5]:
data[np.abs(data) > 3] = np.sign(data) * 3   # sign (data)  根据data的正负返回+1-1

In [6]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.022177    -0.023410     0.051182     0.028932
std       0.981571     0.999067     0.991579     0.988942
min      -3.000000    -3.000000    -2.683573    -3.000000
25%      -0.631316    -0.698879    -0.663944    -0.615301
50%      -0.017898     0.015439     0.062881     0.068810
75%       0.691713     0.683561     0.701815     0.663324
max       2.768177     2.706929     3.000000     3.000000

<h3>排列和随机采样</h3>

In [7]:
data = pd.DataFrame(np.arange(20).reshape((5, 4)))
sample = np.random.permutation(5)  # permuting，随机重排序
sample

array([2, 3, 1, 0, 4])

In [8]:
data.take(sample)    # 按照sample排列

    0   1   2   3
2   8   9  10  11
3  12  13  14  15
1   4   5   6   7
0   0   1   2   3
4  16  17  18  19

In [9]:
data.sample(n=3)

    0   1   2   3
1   4   5   6   7
2   8   9  10  11
4  16  17  18  19

<h3>计算指标</h3>

In [10]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],'data1': range(6)})
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

指标矩阵

In [11]:
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [12]:
dummies = pd.get_dummies(df['key'], prefix='key')
dummies

   key_a  key_b  key_c
0      0      1      0
1      0      1      0
2      1      0      0
3      0      0      1
4      1      0      0
5      0      1      0

In [13]:
data2 = df[['data1']].join(dummies)   # 将生成的矩阵加到data1后边
data2

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

<h3>字符串操作</h3>